# SetDefaultLengthUnit Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
ShapeImporter..::..SetDefaultLengthUnit Method
ShapeImporter Class See Also
---
Sets the length unit to be used when the input is a unitless SAT file.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2017_subscription_update
# Syntax
C#
---
```text
public void SetDefaultLengthUnit(
	ImportUnit defaultLengthUnit
)
```

Visual Basic
---
```text
Public Sub SetDefaultLengthUnit ( _
	defaultLengthUnit As ImportUnit _
)
```

Visual C++
---
```text
public:
void SetDefaultLengthUnit(
	ImportUnit defaultLengthUnit
)
```

# ### Parameters
defaultLengthUnit
    Type: Autodesk.Revit.DB..::..ImportUnit The length unit to be used for when the input is a unitless SAT file.
# Remarks
Values ImportUnit::Default and ImportUnit::Custom are ignored. ImportUnit::Centimeter is used instead.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
ShapeImporter Class
Autodesk.Revit.DB Namespace